In [1]:
import pandas as pd

In [17]:
student_data = {"Name":["Ajees","Ayaana","Ayeesha","Zoya"],
        "Age":[29,1,24,9],
        "City":["Madurai","Goa","Chennai","Madurai"]}

In [18]:
data = pd.DataFrame(student_data)

In [30]:
data

      Name  Age     City
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [31]:
data.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [33]:
data.columns = [x.lower() for x in data.columns ]

In [34]:
data

      name  age     city
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [35]:
data.rename(columns = {"name":"NAME","age":"AGE"}, inplace=True)

In [36]:
data

      NAME  AGE     city
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [37]:
data["last name"] = "Basha"

In [38]:
data

      NAME  AGE     city last name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    9  Madurai     Basha

In [41]:
data.rename(columns={"last name":"Last Name","city":"City"}, inplace=True)

In [42]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    9  Madurai     Basha

In [50]:
data.loc[3]

NAME            Zoya
AGE                9
City         Madurai
Last Name      Basha
Name: 3, dtype: object

In [56]:
data.loc[3] = ["zoya Athifha", 9, "Tirupur", "Yasar"]

In [54]:
data

           NAME  AGE     City Last Name
0         Ajees   29  Madurai     Basha
1        Ayaana    1      Goa     Basha
2       Ayeesha   24  Chennai     Basha
3  zoya Athifha    9  Tirupur     Yasar

In [57]:
data.loc[3,["NAME","AGE"]]=["Zoya",8]

In [58]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    8  Tirupur     Yasar

In [59]:
data.loc[1,"City"]="Chennai"

In [60]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1  Chennai     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    8  Tirupur     Yasar